# Вывести два слова разделенные запятой

first_word = str(input("Enter first word:"))
second_word = str(input("Enter second word:"))
print(first_word, second_word, sep=", ")